<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","label":"management","backend":"cf5efd3e468392c58afefe0a67545faa3cf754f2635e8422aed11171032d7896","plan_job_ref":"Job PR-PLAN #30 at https://github.com/Workquark/Terraform/actions/runs/14159627615","plan_out_hash":"a858c70c3fe5111d2471d2c0772076eff6a7f62bddcc53f4835969036f2da1ba","plan_hash":"b803321b8ed7b9c83db35a418b27c33bc8e5e7904e4d9b489b13c940d49d5e46","plan_text_format":"diff-trunc","version":"1.48.0"} -->
Terraform plan for __management__
<details>
<summary>Plan: 55 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_client_config.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "default" {
+       access_token   = (sensitive value)
+       default_labels = (known after apply)
+       id             = (known after apply)
+       project        = (known after apply)
+       region         = (known after apply)
+       zone           = (known after apply)
    }

  # module.base.google_compute_address.nat_ip will be created
+   resource "google_compute_address" "nat_ip" {
+       address            = (known after apply)
+       address_type       = "EXTERNAL"
+       creation_timestamp = (known after apply)
+       effective_labels   = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       id                 = (known after apply)
+       label_fingerprint  = (known after apply)
+       name               = "europe-west1-nat-ip"
+       network_tier       = (known after apply)
+       prefix_length      = (known after apply)
+       project            = "concise-mesh-453415-t8"
+       purpose            = (known after apply)
+       region             = "europe-west1"
+       self_link          = (known after apply)
+       subnetwork         = (known after apply)
+       terraform_labels   = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       users              = (known after apply)
    }

  # module.base.google_compute_global_address.global_static_ip will be created
+   resource "google_compute_global_address" "global_static_ip" {
+       address            = (known after apply)
+       creation_timestamp = (known after apply)
+       effective_labels   = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       id                 = (known after apply)
+       label_fingerprint  = (known after apply)
+       name               = "global-static-ip"
+       prefix_length      = (known after apply)
+       project            = "concise-mesh-453415-t8"
+       self_link          = (known after apply)
+       terraform_labels   = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
    }

  # module.base.google_project_service.apis["cloudkms.googleapis.com"] will be created
+   resource "google_project_service" "apis" {
+       disable_on_destroy = false
+       id                 = (known after apply)
+       project            = "concise-mesh-453415-t8"
+       service            = "cloudkms.googleapis.com"

+       timeouts {
+           create = "30m"
+           update = "40m"
        }
    }

  # module.base.google_project_service.apis["compute.googleapis.com"] will be created
+   resource "google_project_service" "apis" {
+       disable_on_destroy = false
+       id                 = (known after apply)
+       project            = "concise-mesh-453415-t8"
+       service            = "compute.googleapis.com"

+       timeouts {
+           create = "30m"
+           update = "40m"
        }
    }

  # module.base.google_project_service.apis["container.googleapis.com"] will be created
+   resource "google_project_service" "apis" {
+       disable_on_destroy = false
+       id                 = (known after apply)
+       project            = "concise-mesh-453415-t8"
+       service            = "container.googleapis.com"

+       timeouts {
+           create = "30m"
+           update = "40m"
        }
    }

  # module.base.google_project_service.apis["iam.googleapis.com"] will be created
+   resource "google_project_service" "apis" {
+       disable_on_destroy = false
+       id                 = (known after apply)
+       project            = "concise-mesh-453415-t8"
+       service            = "iam.googleapis.com"

+       timeouts {
+           create = "30m"
+           update = "40m"
        }
    }

  # module.base.google_project_service.apis["secretmanager.googleapis.com"] will be created
+   resource "google_project_service" "apis" {
+       disable_on_destroy = false
+       id                 = (known after apply)
+       project            = "concise-mesh-453415-t8"
+       service            = "secretmanager.googleapis.com"

+       timeouts {
+           create = "30m"
+           update = "40m"
        }
    }

  # module.base.random_password.password will be created
+   resource "random_password" "password" {
+       bcrypt_hash      = (sensitive value)
+       id               = (known after apply)
+       length           = 16
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       numeric          = true
+       override_special = "-_"
+       result           = (sensitive value)
+       special          = true
+       upper            = true
    }

  # module.gke_dev.data.google_client_config.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "default" {
+       access_token   = (sensitive value)
+       default_labels = (known after apply)
+       id             = (known after apply)
+       project        = (known after apply)
+       region         = (known after apply)
+       zone           = (known after apply)
    }

  # module.twingate.google_compute_instance.twingate[0] will be created
+   resource "google_compute_instance" "twingate" {
+       allow_stopping_for_update = true
+       can_ip_forward            = false
+       cpu_platform              = (known after apply)
+       creation_timestamp        = (known after apply)
+       current_status            = (known after apply)
+       deletion_protection       = false
+       effective_labels          = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       id                        = (known after apply)
+       instance_id               = (known after apply)
+       label_fingerprint         = (known after apply)
+       machine_type              = "e2-micro"
+       metadata                  = (known after apply)
+       metadata_fingerprint      = (known after apply)
+       metadata_startup_script   = <<-EOT
            echo 'net.ipv4.ping_group_range = 0 2147483647' | sudo tee -a /etc/sysctl.d/99-allow-ping.conf
                sudo sysctl -p /etc/sysctl.d/99-allow-ping.conf
        EOT
+       min_cpu_platform          = (known after apply)
+       name                      = "jrc-online-management-twingate-0"
+       project                   = "concise-mesh-453415-t8"
+       self_link                 = (known after apply)
+       tags_fingerprint          = (known after apply)
+       terraform_labels          = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       zone                      = "europe-west1-b"

+       boot_disk {
+           auto_delete                = true
+           device_name                = (known after apply)
+           disk_encryption_key_sha256 = (known after apply)
+           guest_os_features          = (known after apply)
+           kms_key_self_link          = (known after apply)
+           mode                       = "READ_WRITE"
+           source                     = (known after apply)

+           initialize_params {
+               architecture           = (known after apply)
+               image                  = (known after apply)
+               labels                 = (known after apply)
+               provisioned_iops       = (known after apply)
+               provisioned_throughput = (known after apply)
+               resource_policies      = (known after apply)
+               size                   = (known after apply)
+               type                   = (known after apply)
            }
        }

+       confidential_instance_config (known after apply)

+       guest_accelerator (known after apply)

+       network_interface {
+           internal_ipv6_prefix_length = (known after apply)
+           ipv6_access_type            = (known after apply)
+           ipv6_address                = (known after apply)
+           name                        = (known after apply)
+           network                     = (known after apply)
+           network_attachment          = (known after apply)
+           network_ip                  = (known after apply)
+           stack_type                  = (known after apply)
+           subnetwork                  = "ops-management-subnet-1"
+           subnetwork_project          = "concise-mesh-453415-t8"
        }

+       reservation_affinity (known after apply)

+       scheduling (known after apply)

+       shielded_instance_config {
+           enable_integrity_monitoring = true
+           enable_secure_boot          = true
+           enable_vtpm                 = true
        }
    }

  # module.twingate.google_compute_instance.twingate[1] will be created
+   resource "google_compute_instance" "twingate" {
+       allow_stopping_for_update = true
+       can_ip_forward            = false
+       cpu_platform              = (known after apply)
+       creation_timestamp        = (known after apply)
+       current_status            = (known after apply)
+       deletion_protection       = false
+       effective_labels          = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       id                        = (known after apply)
+       instance_id               = (known after apply)
+       label_fingerprint         = (known after apply)
+       machine_type              = "e2-micro"
+       metadata                  = (known after apply)
+       metadata_fingerprint      = (known after apply)
+       metadata_startup_script   = <<-EOT
            echo 'net.ipv4.ping_group_range = 0 2147483647' | sudo tee -a /etc/sysctl.d/99-allow-ping.conf
                sudo sysctl -p /etc/sysctl.d/99-allow-ping.conf
        EOT
+       min_cpu_platform          = (known after apply)
+       name                      = "jrc-online-management-twingate-1"
+       project                   = "concise-mesh-453415-t8"
+       self_link                 = (known after apply)
+       tags_fingerprint          = (known after apply)
+       terraform_labels          = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       zone                      = "europe-west1-b"

+       boot_disk {
+           auto_delete                = true
+           device_name                = (known after apply)
+           disk_encryption_key_sha256 = (known after apply)
+           guest_os_features          = (known after apply)
+           kms_key_self_link          = (known after apply)
+           mode                       = "READ_WRITE"
+           source                     = (known after apply)

+           initialize_params {
+               architecture           = (known after apply)
+               image                  = (known after apply)
+               labels                 = (known after apply)
+               provisioned_iops       = (known after apply)
+               provisioned_throughput = (known after apply)
+               resource_policies      = (known after apply)
+               size                   = (known after apply)
+               type                   = (known after apply)
            }
        }

+       confidential_instance_config (known after apply)

+       guest_accelerator (known after apply)

+       network_interface {
+           internal_ipv6_prefix_length = (known after apply)
+           ipv6_access_type            = (known after apply)
+           ipv6_address                = (known after apply)
+           name                        = (known after apply)
+           network                     = (known after apply)
+           network_attachment          = (known after apply)
+           network_ip                  = (known after apply)
+           stack_type                  = (known after apply)
+           subnetwork                  = "ops-management-subnet-1"
+           subnetwork_project          = "concise-mesh-453415-t8"
        }

+       reservation_affinity (known after apply)

+       scheduling (known after apply)

+       shielded_instance_config {
+           enable_integrity_monitoring = true
+           enable_secure_boot          = true
+           enable_vtpm                 = true
        }
    }

  # module.twingate.null_resource.version will be created
+   resource "null_resource" "version" {
+       id       = (known after apply)
+       triggers = {
+           "version" = "1.73.0"
        }
    }

  # module.twingate.twingate_connector.connector[0] will be created
+   resource "twingate_connector" "connector" {
+       id                     = (known after apply)
+       name                   = "twingate-management-0"
+       remote_network_id      = (known after apply)
+       status_updates_enabled = (known after apply)
    }

  # module.twingate.twingate_connector.connector[1] will be created
+   resource "twingate_connector" "connector" {
+       id                     = (known after apply)
+       name                   = "twingate-management-1"
+       remote_network_id      = (known after apply)
+       status_updates_enabled = (known after apply)
    }

  # module.twingate.twingate_connector_tokens.tokens[0] will be created
+   resource "twingate_connector_tokens" "tokens" {
+       access_token  = (sensitive value)
+       connector_id  = (known after apply)
+       id            = (known after apply)
+       refresh_token = (sensitive value)
    }

  # module.twingate.twingate_connector_tokens.tokens[1] will be created
+   resource "twingate_connector_tokens" "tokens" {
+       access_token  = (sensitive value)
+       connector_id  = (known after apply)
+       id            = (known after apply)
+       refresh_token = (sensitive value)
    }

  # module.twingate.twingate_remote_network.network will be created
+   resource "twingate_remote_network" "network" {
+       id       = (known after apply)
+       location = "GOOGLE_CLOUD"
+       name     = "jrc-online-management-vpc-network"
    }

  # module.twingate.twingate_resource.twingate_resources will be created
+   resource "twingate_resource" "twingate_resources" {
+       address                     = "10.80.21.0/28"
+       id                          = (known after apply)
+       is_active                   = true
+       is_authoritative            = (known after apply)
+       is_browser_shortcut_enabled = false
+       is_visible                  = true
+       name                        = "jrc-online-management-gke"
+       protocols                   = {
+           allow_icmp = true
+           tcp        = {
+               policy = "ALLOW_ALL"
+               ports  = []
            }
+           udp        = {
+               policy = "ALLOW_ALL"
+               ports  = []
            }
        }
+       remote_network_id           = (known after apply)

+       access_group {
+           group_id = "****************"
        }
    }

  # module.base.module.cloud_dns_zone["druidsoft.in."].google_dns_managed_zone.public[0] will be created
+   resource "google_dns_managed_zone" "public" {
+       creation_time    = (known after apply)
+       description      = "Managed by Terraform"
+       dns_name         = "druidsoft.in."
+       effective_labels = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       force_destroy    = false
+       id               = (known after apply)
+       managed_zone_id  = (known after apply)
+       name             = "druidsoft-in"
+       name_servers     = (known after apply)
+       project          = "concise-mesh-453415-t8"
+       terraform_labels = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       visibility       = "public"

+       cloud_logging_config {
+           enable_logging = false
        }

+       dnssec_config (known after apply)
    }

  # module.base.module.cloud_private_dns_zone["druidsoft.in."].google_dns_managed_zone.private[0] will be created
+   resource "google_dns_managed_zone" "private" {
+       creation_time    = (known after apply)
+       description      = "Managed by Terraform"
+       dns_name         = "private.druidsoft.in."
+       effective_labels = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       force_destroy    = false
+       id               = (known after apply)
+       managed_zone_id  = (known after apply)
+       name             = "private-druidsoft-in"
+       name_servers     = (known after apply)
+       project          = "concise-mesh-453415-t8"
+       terraform_labels = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       visibility       = "private"

+       cloud_logging_config (known after apply)

+       dnssec_config (known after apply)

+       private_visibility_config {
+           networks {
+               network_url = (known after apply)
            }
        }
    }

  # module.base.module.cloud_router.google_compute_router.router will be created
+   resource "google_compute_router" "router" {
+       creation_timestamp            = (known after apply)
+       encrypted_interconnect_router = false
+       id                            = (known after apply)
+       name                          = "jrc-online-management-vpc-network-router"
+       network                       = "jrc-online-management-vpc-network"
+       project                       = "concise-mesh-453415-t8"
+       region                        = "europe-west1"
+       self_link                     = (known after apply)

+       bgp {
+           advertise_mode     = "CUSTOM"
+           advertised_groups  = [
+               "ALL_SUBNETS",
            ]
+           asn                = 64514
+           identifier_range   = (known after apply)
+           keepalive_interval = 20
        }
    }

  # module.base.module.cloud_router.google_compute_router_nat.nats["jrc-online-management-vpc-network-nat-gateway"] will be created
+   resource "google_compute_router_nat" "nats" {
+       auto_network_tier                   = (known after apply)
+       drain_nat_ips                       = (known after apply)
+       enable_dynamic_port_allocation      = (known after apply)
+       enable_endpoint_independent_mapping = (known after apply)
+       endpoint_types                      = (known after apply)
+       icmp_idle_timeout_sec               = 30
+       id                                  = (known after apply)
+       min_ports_per_vm                    = (known after apply)
+       name                                = "jrc-online-management-vpc-network-nat-gateway"
+       nat_ip_allocate_option              = "MANUAL_ONLY"
+       nat_ips                             = (known after apply)
+       project                             = "concise-mesh-453415-t8"
+       region                              = "europe-west1"
+       router                              = "jrc-online-management-vpc-network-router"
+       source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
+       tcp_established_idle_timeout_sec    = 1200
+       tcp_time_wait_timeout_sec           = 120
+       tcp_transitory_idle_timeout_sec     = 30
+       udp_idle_timeout_sec                = 30

+       log_config {
+           enable = true
+           filter = "ALL"
        }
    }

  # module.base.module.dns_admins.google_project_iam_member.project-roles["cert-manager-concise-mesh-453415-t8=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/dns.admin"
    }

  # module.base.module.dns_admins.google_project_iam_member.project-roles["cert-manager-concise-mesh-453415-t8=>roles/iam.serviceAccountTokenCreator"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.base.module.dns_admins.google_project_iam_member.project-roles["external-dns-concise-mesh-453415-t8=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/dns.admin"
    }

  # module.base.module.dns_admins.google_project_iam_member.project-roles["external-dns-concise-mesh-453415-t8=>roles/iam.serviceAccountTokenCreator"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.base.module.dns_admins.google_service_account.service_accounts["cert-manager"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "************"
+       description  = "Service account for cert-manager in gke"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = "cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "concise-mesh-453415-t8"
+       unique_id    = (known after apply)
    }

  # module.base.module.dns_admins.google_service_account.service_accounts["external-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "************"
+       description  = "Service account for external dns in gke"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = "external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "concise-mesh-453415-t8"
+       unique_id    = (known after apply)
    }

  # module.base.module.dns_zones_iam_binding.google_dns_managed_zone_iam_member.dns_zone_iam_additive["default--roles/dns.admin--serviceAccount:cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"] will be created
+   resource "google_dns_managed_zone_iam_member" "dns_zone_iam_additive" {
+       etag         = (known after apply)
+       id           = (known after apply)
+       managed_zone = "druidsoft-in"
+       member       = "serviceAccount:cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project      = "concise-mesh-453415-t8"
+       role         = "roles/dns.admin"
    }

  # module.base.module.dns_zones_iam_binding.google_dns_managed_zone_iam_member.dns_zone_iam_additive["default--roles/dns.admin--serviceAccount:external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"] will be created
+   resource "google_dns_managed_zone_iam_member" "dns_zone_iam_additive" {
+       etag         = (known after apply)
+       id           = (known after apply)
+       managed_zone = "druidsoft-in"
+       member       = "serviceAccount:external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project      = "concise-mesh-453415-t8"
+       role         = "roles/dns.admin"
    }

  # module.base.module.firewall_rules.google_compute_firewall.rules_ingress_egress["jrc-online-management-vpc-network-gke-ingress-rule"] will be created
+   resource "google_compute_firewall" "rules_ingress_egress" {
+       creation_timestamp = (known after apply)
+       description        = "allow all internal traffic across the vpc"
+       destination_ranges = [
+           "10.80.0.0/16",
        ]
+       direction          = "INGRESS"
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "jrc-online-management-vpc-network-gke-ingress-rule"
+       network            = "jrc-online-management-vpc-network"
+       priority           = 1000
+       project            = "concise-mesh-453415-t8"
+       self_link          = (known after apply)
+       source_ranges      = [
+           "10.81.0.0/16",
        ]

+       allow {
+           ports    = []
+           protocol = "icmp"
        }
+       allow {
+           ports    = []
+           protocol = "tcp"
        }
+       allow {
+           ports    = []
+           protocol = "udp"
        }

+       log_config {
+           metadata = "INCLUDE_ALL_METADATA"
        }
    }

  # module.base.module.secret-manager.google_secret_manager_secret.secrets["argocd-dex-oauth-secret"] will be created
+   resource "google_secret_manager_secret" "secrets" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       name                  = (known after apply)
+       project               = "concise-mesh-453415-t8"
+       secret_id             = "***********************"
+       terraform_labels      = {
+           "environment"                = "management"
+           "github_repo"                = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "managed_by"                 = "terraform"
+           "owner"                      = "joydeep"
+           "project"                    = "concise-mesh-453415-t8"
        }

+       replication {
+           auto {
            }
        }
    }

  # module.base.module.secret-manager.google_secret_manager_secret_version.secret-version["argocd-dex-oauth-secret"] will be created
+   resource "google_secret_manager_secret_version" "secret-version" {
+       create_time            = (known after apply)
+       deletion_policy        = "DELETE"
+       destroy_time           = (known after apply)
+       enabled                = true
+       id                     = (known after apply)
+       is_secret_data_base64  = false
+       name                   = (known after apply)
+       secret                 = (known after apply)
+       secret_data            = (sensitive value)
+       secret_data_wo         = (write-only attribute)
+       secret_data_wo_version = 0
+       version                = (known after apply)
    }

  # module.base.module.secrets_manager_admins.google_project_iam_member.project-roles["external-secrets-concise-mesh-453415-t8=>roles/iam.serviceAccountTokenCreator"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:external-secrets@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.base.module.secrets_manager_admins.google_project_iam_member.project-roles["external-secrets-concise-mesh-453415-t8=>roles/secretmanager.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:external-secrets@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project = "concise-mesh-453415-t8"
+       role    = "roles/secretmanager.admin"
    }

  # module.base.module.secrets_manager_admins.google_service_account.service_accounts["external-secrets"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "****************"
+       description  = "Service account for external secrets in gke"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = "external-secrets@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:external-secrets@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "concise-mesh-453415-t8"
+       unique_id    = (known after apply)
    }

  # module.base.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/gke-management-cluster-subnet-1"] will be created
+   resource "google_compute_subnetwork" "subnetwork" {
+       creation_timestamp         = (known after apply)
+       description                = "This is the default gke dev cluster-1 regional subnet in region europe-west1"
+       enable_flow_logs           = (known after apply)
+       external_ipv6_prefix       = (known after apply)
+       fingerprint                = (known after apply)
+       gateway_address            = (known after apply)
+       id                         = (known after apply)
+       internal_ipv6_prefix       = (known after apply)
+       ip_cidr_range              = "10.80.1.0/24"
+       ipv6_cidr_range            = (known after apply)
+       ipv6_gce_endpoint          = (known after apply)
+       name                       = "gke-management-cluster-subnet-1"
+       network                    = "jrc-online-management-vpc-network"
+       private_ip_google_access   = true
+       private_ipv6_google_access = (known after apply)
+       project                    = "concise-mesh-453415-t8"
+       purpose                    = (known after apply)
+       region                     = "europe-west1"
+       self_link                  = (known after apply)
+       stack_type                 = (known after apply)
+       state                      = (known after apply)
+       subnetwork_id              = (known after apply)

+       secondary_ip_range {
+           ip_cidr_range = "10.80.11.0/24"
+           range_name    = "gke-management-cluster-service-subnet-1"
        }
+       secondary_ip_range {
+           ip_cidr_range = "10.81.0.0/16"
+           range_name    = "gke-management-cluster-pod-subnet-1"
        }
    }

  # module.base.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/gke-management-private-endpoint-subnet-1"] will be created
+   resource "google_compute_subnetwork" "subnetwork" {
+       creation_timestamp         = (known after apply)
+       description                = "This is the default gke private endpoint subnet in region europe-west1"
+       enable_flow_logs           = (known after apply)
+       external_ipv6_prefix       = (known after apply)
+       fingerprint                = (known after apply)
+       gateway_address            = (known after apply)
+       id                         = (known after apply)
+       internal_ipv6_prefix       = (known after apply)
+       ip_cidr_range              = "10.80.21.0/28"
+       ipv6_cidr_range            = (known after apply)
+       ipv6_gce_endpoint          = (known after apply)
+       name                       = "gke-management-private-endpoint-subnet-1"
+       network                    = "jrc-online-management-vpc-network"
+       private_ip_google_access   = true
+       private_ipv6_google_access = (known after apply)
+       project                    = "concise-mesh-453415-t8"
+       purpose                    = (known after apply)
+       region                     = "europe-west1"
+       self_link                  = (known after apply)
+       stack_type                 = (known after apply)
+       state                      = (known after apply)
+       subnetwork_id              = (known after apply)

+       secondary_ip_range (known after apply)
    }

  # module.base.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/ops-management-subnet-1"] will be created
+   resource "google_compute_subnetwork" "subnetwork" {
+       creation_timestamp         = (known after apply)
+       description                = "This is the default operations/devops resources regional subnet in region europe-west1"
+       enable_flow_logs           = (known after apply)
+       external_ipv6_prefix       = (known after apply)
+       fingerprint                = (known after apply)
+       gateway_address            = (known after apply)
+       id                         = (known after apply)
+       internal_ipv6_prefix       = (known after apply)
+       ip_cidr_range              = "10.80.21.240/28"
+       ipv6_cidr_range            = (known after apply)
+       ipv6_gce_endpoint          = (known after apply)
+       name                       = "ops-management-subnet-1"
+       network                    = "jrc-online-management-vpc-network"
+       private_ip_google_access   = true
+       private_ipv6_google_access = (known after apply)
+       project                    = "concise-mesh-453415-t8"
+       purpose                    = (known after apply)
+       region                     = "europe-west1"
+       self_link                  = (known after apply)
+       stack_type                 = (known after apply)
+       state                      = (known after apply)
+       subnetwork_id              = (known after apply)

+       secondary_ip_range (known after apply)
    }

  # module.base.module.vpc.google_compute_network.network will be created
+   resource "google_compute_network" "network" {
+       auto_create_subnetworks                   = false
+       bgp_always_compare_med                    = (known after apply)
+       bgp_best_path_selection_mode              = (known after apply)
+       bgp_inter_region_cost                     = (known after apply)
+       delete_default_routes_on_create           = false
+       enable_ula_internal_ipv6                  = false
+       gateway_ipv4                              = (known after apply)
+       id                                        = (known after apply)
+       internal_ipv6_range                       = (known after apply)
+       mtu                                       = 1460
+       name                                      = "jrc-online-management-vpc-network"
+       network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
+       network_id                                = (known after apply)
+       numeric_id                                = (known after apply)
+       project                                   = "concise-mesh-453415-t8"
+       routing_mode                              = "REGIONAL"
+       self_link                                 = (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.gke_dev.module.gke.data.google_compute_zones.available[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "concise-mesh-453415-t8"
+       region  = "europe-west1"
    }

  # module.gke_dev.module.gke.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "europe-west1"
+       project                         = "concise-mesh-453415-t8"
+       release_channel_default_version = (known after apply)
+       release_channel_latest_version  = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke_dev.module.gke.data.google_container_engine_versions.zone will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = (known after apply)
+       project                         = "concise-mesh-453415-t8"
+       release_channel_default_version = (known after apply)
+       release_channel_latest_version  = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke_dev.module.gke.google_container_cluster.primary will be created
+   resource "google_container_cluster" "primary" {
+       cluster_ipv4_cidr                        = (known after apply)
+       datapath_provider                        = (known after apply)
+       default_max_pods_per_node                = 110
+       deletion_protection                      = false
+       effective_labels                         = {
+           "goog-terraform-provisioned" = "true"
        }
+       enable_cilium_clusterwide_network_policy = false
+       enable_fqdn_network_policy               = false
+       enable_intranode_visibility              = true
+       enable_kubernetes_alpha                  = false
+       enable_l4_ilb_subsetting                 = true
+       enable_legacy_abac                       = false
+       enable_multi_networking                  = false
+       enable_shielded_nodes                    = true
+       enable_tpu                               = false
+       endpoint                                 = (known after apply)
+       id                                       = (known after apply)
+       label_fingerprint                        = (known after apply)
+       location                                 = "europe-west1"
+       logging_service                          = "logging.googleapis.com/kubernetes"
+       master_version                           = (known after apply)
+       min_master_version                       = "1.32.2"
+       monitoring_service                       = "monitoring.googleapis.com/kubernetes"
+       name                                     = "jrc-online-management-gke-cluster"
+       network                                  = "projects/concise-mesh-453415-t8/global/networks/jrc-online-management-vpc-network"
+       networking_mode                          = "VPC_NATIVE"
+       node_locations                           = (known after apply)
+       node_version                             = (known after apply)
+       operation                                = (known after apply)
+       private_ipv6_google_access               = (known after apply)
+       project                                  = "concise-mesh-453415-t8"
+       remove_default_node_pool                 = true
+       self_link                                = (known after apply)
+       services_ipv4_cidr                       = (known after apply)
+       subnetwork                               = "projects/concise-mesh-453415-t8/regions/europe-west1/subnetworks/gke-management-cluster-subnet-1"
+       terraform_labels                         = {
+           "goog-terraform-provisioned" = "true"
        }
+       tpu_ipv4_cidr_block                      = (known after apply)
#        (1 unchanged attribute hidden)

+       addons_config {
+           cloudrun_config (known after apply)
+           config_connector_config {
+               enabled = false
            }
+           dns_cache_config {
+               enabled = false
            }
+           gce_persistent_disk_csi_driver_config {
+               enabled = true
            }
+           gcp_filestore_csi_driver_config {
+               enabled = true
            }
+           gcs_fuse_csi_driver_config (known after apply)
+           gke_backup_agent_config {
+               enabled = true
            }
+           horizontal_pod_autoscaling {
+               disabled = false
            }
+           http_load_balancing {
+               disabled = false
            }
+           istio_config {
+               auth     = "AUTH_MUTUAL_TLS"
+               disabled = true
            }
+           kalm_config {
+               enabled = false
            }
+           network_policy_config {
+               disabled = false
            }
+           parallelstore_csi_driver_config (known after apply)
+           ray_operator_config (known after apply)
+           stateful_ha_config (known after apply)
        }

+       authenticator_groups_config (known after apply)

+       cluster_autoscaling {
+           auto_provisioning_locations = (known after apply)
+           autoscaling_profile         = "BALANCED"
+           enabled                     = false

+           auto_provisioning_defaults (known after apply)
        }

+       cluster_telemetry (known after apply)

+       confidential_nodes (known after apply)

+       control_plane_endpoints_config (known after apply)

+       cost_management_config {
+           enabled = true
        }

+       database_encryption {
+           state    = "DECRYPTED"
#            (1 unchanged attribute hidden)
        }

+       default_snat_status {
+           disabled = false
        }

+       enterprise_config (known after apply)

+       gateway_api_config {
+           channel = "CHANNEL_STANDARD"
        }

+       identity_service_config {
+           enabled = false
        }

+       ip_allocation_policy {
+           cluster_ipv4_cidr_block       = (known after apply)
+           cluster_secondary_range_name  = "gke-management-cluster-pod-subnet-1"
+           services_ipv4_cidr_block      = (known after apply)
+           services_secondary_range_name = "gke-management-cluster-service-subnet-1"
+           stack_type                    = "IPV4"

+           pod_cidr_overprovision_config (known after apply)
        }

+       logging_config (known after apply)

+       maintenance_policy {
+           daily_maintenance_window {
+               duration   = (known after apply)
+               start_time = "05:00"
            }
        }

+       master_auth {
+           client_certificate     = (known after apply)
+           client_key             = (sensitive value)
+           cluster_ca_certificate = (known after apply)

+           client_certificate_config {
+               issue_client_certificate = false
            }
        }

+       master_authorized_networks_config {
+           gcp_public_cidrs_access_enabled      = (known after apply)
+           private_endpoint_enforcement_enabled = (known after apply)

+           cidr_blocks {
+               cidr_block   = "10.80.0.0/16"
+               display_name = "jrc-online_network"
            }
+           cidr_blocks {
+               cidr_block   = "10.80.21.240/28"
+               display_name = "twingate_network"
            }
+           cidr_blocks {
+               cidr_block   = "10.81.0.0/16"
+               display_name = "argocd"
            }
        }

+       mesh_certificates {
+           enable_certificates = false
        }

+       monitoring_config (known after apply)

+       network_policy {
+           enabled  = true
+           provider = "CALICO"
        }

+       node_config (known after apply)

+       node_pool {
+           initial_node_count          = 0
+           instance_group_urls         = (known after apply)
+           managed_instance_group_urls = (known after apply)
+           max_pods_per_node           = (known after apply)
+           name                        = "default-pool"
+           name_prefix                 = (known after apply)
+           node_count                  = (known after apply)
+           node_locations              = (known after apply)
+           version                     = (known after apply)

+           management {
+               auto_repair  = true
+               auto_upgrade = true
            }

+           network_config (known after apply)

+           node_config {
+               disk_size_gb                = (known after apply)
+               disk_type                   = (known after apply)
+               effective_taints            = (known after apply)
+               enable_confidential_storage = false
+               image_type                  = "UBUNTU_CONTAINERD"
+               labels                      = (known after apply)
+               local_ssd_count             = (known after apply)
+               logging_variant             = "DEFAULT"
+               machine_type                = "e2-standard-2"
+               metadata                    = (known after apply)
+               min_cpu_platform            = (known after apply)
+               oauth_scopes                = (known after apply)
+               preemptible                 = false
+               service_account             = "jrc-online-management-gke@concise-mesh-453415-t8.iam.gserviceaccount.com"
+               spot                        = false
+               tags                        = [
+                   "gke-jrc-online-management-gke-cluster",
+                   "gke-jrc-online-management-gke-cluster-default-pool",
                ]

Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [PR-PLAN #30](https://github.com/Workquark/Terraform/actions/runs/14159627615)